"""__author__=蒋志颖"""
# 1.数学集合运算：并集(|),交集(&),差集(-),对称差集(^),>/<(包含关系)
set1 = {1, 2, 3, 4, 5, 6}
set2 = {4, 5, 6, 7, 8}

# 1)并集：集合1 | 集合2 -> 将两个集合合并在一起产生一个新的集合
print(set1 | set2)

# 2)交集：集合1 & 集合2 -> 获取两个集合的公共部分产生一个新的集合
print(set1 & set2)

# 3)差集：集合1 - 集合2 ->  获取前面集合特有的元素
print(set1 - set2)
print(set2 - set1)

# 4)对称差集：集合1 ^ 集合2 ->   获取两个集合特有元素的并集
print(set1 ^ set2)

# 5) 集合1 > 集合2  - 判断集合1中是否包含集合2
#    集合1 < 集合2  - 判断集合2中是否包含集合1
set3 = {5, 6, 7, 8, 9}
set4 = {1, 2}
print(set3 > set4)    # False
print(set3 > {5, 6})  # True
print(set3 > {5, 6, 1})   # False
